package generator

type Category struct {
	ID          int    `csv:"id"`
	Name        string `csv:"name"`
	Description string `csv:"description"`
	ParentID    *int   `csv:"parent"`
	Slug        string `csv:"slug"`
}

func intPtr(v int) *int {
	return &v
}

func genCategories() ([]Category, error) {
	return []Category{
		{
			ID:          1,
			Name:        "Главная",
			Description: "Описание товара...",
			ParentID:    nil,
			Slug:        "main",
		},
		{
			ID:          2,
			Name:        "Наркотические вещества",
			Description: "Описание товара...",
			ParentID:    intPtr(1),
			Slug:        "drugs",
		},
		{
			ID:          3,
			Name:        "Оружие и боевая техника",
			Description: "Описание товара...",
			ParentID:    intPtr(1),
			Slug:        "weapons",
		},
		{
			ID:          4,
			Name:        "Запрещенные вещества",
			Description: "Описание товара...",
			ParentID:    intPtr(1),
			Slug:        "prohibited_substances",
		},
		{
			ID:          5,
			Name:        "Опиаты",
			Description: "Наркотики, обладающие седативным, «затормаживающим» действием. К этой группе относятся природные и синтетические морфиноподобные соединения. Все природные наркотические средства опийной группы получают из мака. Вызывают состояние эйфории, спокойствия, умиротворения.",
			ParentID:    intPtr(2),
			Slug:        "opiates",
		},
		{
			ID:          6,
			Name:        "Препараты конопли",
			Description: "Конопля произрастает в регионах с умеренно теплым климатом. Чем южнее выращено растение, тем больший наркотический эффект вызывает изготовленный из него наркотик. Действующие вещества — каннабиноиды. Воздействие — изменение сознания.",
			ParentID:    intPtr(2),
			Slug:        "cannabis",
		},
		{
			ID:          7,
			Name:        "Амфетамины", // final
			Description: "Наркотики, обладающие психостимулирующим, «возбуждающим» действием. К этой группе относятся синтетические вещества, содержащие соединения амфетамина. В большинстве случаев вводятся внутривенно. Эти наркотики получают из лекарственных препаратов, содержащих эфедрин (солутан, эфидрина гидрохлорид). В природе эфедрин содержится в растении «эфедра». Действие наркотика продолжается 2–12 часов (в зависимости от типа вещества).",
			ParentID:    intPtr(2),
			Slug:        "amphetamines",
		},
		{
			ID:          8,
			Name:        "Кокаин",
			Description: "Психостимулятор растительного происхождения, получаемый из листьев растения коки. ",
			ParentID:    intPtr(2),
			Slug:        "cocaine",
		},
		{
			ID:          9,
			Name:        "Галлюциногены",
			Description: "Неоднородная по происхождению и химическому составу группа психоделических препаратов, изменяющих сознание — ощущения, мысли, эмоции и восприятие.",
			ParentID:    intPtr(2),
			Slug:        "hallucinogens",
		},
		{
			ID:          10,
			Name:        "Экстази", // final
			Description: "«Экстази» — общее название для группы синтетических наркотиков-стимуляторов амфетаминной группы, часто с галлюциногенным эффектом. Белые, коричневые, розовые и желтые таблетки или разноцветные, часто с рисунками, капсулы содержат около 150 мг препарата.",
			ParentID:    intPtr(2),
			Slug:        "ecstasy",
		},
		{
			ID:          11,
			Name:        "Снотворные", // final
			Description: "Группа седативных (успокаивающих) и снотворных веществ, встречающихся в виде официальных препаратов, обычно таблеток («колеса») или капсул.",
			ParentID:    intPtr(2),
			Slug:        "sleeping_pills",
		},
		{
			ID:          12,
			Name:        "Героин", // final
			Description: "Героин («герыч», «белый», «лошадь», «смак») — наиболее распространенный опийный наркотик. Наряду с очень сильным и ярко выраженным наркотическим эффектом обладает крайне высокой токсичностью и способностью быстро (после 2–3 приемов) формировать физическую зависимость. Героин курят, нюхают и вводят внутривенно.",
			ParentID:    intPtr(5),
			Slug:        "heroin",
		},
		{
			ID:          13,
			Name:        "Сырец", // final
			Description: "Опий-сырец («ханка», «жмых», «опиуха») — специально обработанный сок растений мака, используется как сырье для приготовления раствора ацетилированного опия. Вещество, напоминающее пластилин. Цвет — от белого до коричневого. Продается небольшими кусочками шариками.",
			ParentID:    intPtr(5),
			Slug:        "raw_opitz",
		},
		{
			ID:          14,
			Name:        "Метадон", // final
			Description: "Метадон — сильный синтетический наркотик опийной группы. Продается в виде белого порошка или готового раствора. В некоторых странах разрешен как средство заместительной терапии при лечении опийной наркомании.",
			ParentID:    intPtr(5),
			Slug:        "methadone",
		},
		{
			ID:          15,
			Name:        "Марихуана", // final
			Description: "Марихуана («травка», «шмаль», «анаша», «зелье»)- высушенная или сырая зеленая травянистая часть конопли. Светлые, зеленовато-коричневые размолотые листья и цветущие верхушки конопли. Может быть плотно спрессована в комки. Этот наркотик курят в виде сигарет-самокруток («косяков»), а также набивают в трубки, добавляют в пищу.",
			ParentID:    intPtr(6),
			Slug:        "marijuana",
		},
		{
			ID:          16,
			Name:        "Гашиш", // final
			Description: "Гашиш («план», «дурь», «чернуха») — смесь смолы, пыльцы и измельченных верхушек конопли — смолистое вещество темно-коричневого цвета, похожее на пластилин, в виде брикетиков или капсул. Содержит более 20% каннабиоидов. Гашиш курят с помощью специальных приспособлений. Действие наркотика наступает через 10–30 минут после курения и может продолжатся несколько часов. ",
			ParentID:    intPtr(6),
			Slug:        "hashish",
		},
		{
			ID:          17,
			Name:        "Кокаин", // final
			Description: "Кокаин («дутый», «кокс», «снег», «кока», «вдох», «конфетка для носа», «свисток», «снежинка») — белый кристаллический порошок, обычно вдыхаемый через трубку или соломку с гладкой поверхности, такой, как стекло или зеркало. Гидрохлорид кокаина легко растворяется в воде, поэтому его не только нюхают, но иногда вводят внутривенно или глотают.",
			ParentID:    intPtr(8),
			Slug:        "cocaine",
		},
		{
			ID:          18,
			Name:        "Крек", // final
			Description: "Крек («камень») — хрупкие пластинки, образующиеся в результате смешения кокаина с пищевой содой и водой и выпаривания, используется для курения. Крэк чрезвычайно быстро вырабатывает как физическую, так и психологическую зависимость.",
			ParentID:    intPtr(8),
			Slug:        "crack",
		},
		{
			ID:          19,
			Name:        "ЛСД", // final
			Description: "ЛСД («кислота», «марки», «промокашка», «красный дракон») — синтетический наркотик, производное лизергиновой кислоты, содержащейся в спорынье. Бесцветный порошок без запаха или прозрачная жидкость без запаха, цвета и вкуса. Жидкостью пропитывают разрисованную яркими рисунками бумагу или ткань. Кусочек ее кладется под язык, действие оказывает через 30–60 минут и продолжается до 12 часов. Оказывает огромный галлюциногенный эффект в малых концентрациях — 30г. ЛСД достаточно для 300 000 тысяч человек.",
			ParentID:    intPtr(9),
			Slug:        "lsd",
		},
		{
			ID:          20,
			Name:        "Грибы", // final
			Description: "Псилоцин и псилоцибин («грибы», «поганки») — наркотические вещества, обладающие галлюциногенным эффектом. Содержаться в грибах-поганках. Для наступления наркотического эффекта достаточно принять 2 грамма сухих грибов. Главная опасность этого наркотика — его доступность.",
			ParentID:    intPtr(9),
			Slug:        "mushrooms",
		},
		{
			ID:          21, // final
			Name:        "Холодное оружие",
			Description: "Описание товара...",
			ParentID:    intPtr(3),
			Slug:        "cold_weapons",
		},
		{
			ID:          22,
			Name:        "Огнестрельное оружие",
			Description: "Описание товара...",
			ParentID:    intPtr(3),
			Slug:        "firearms",
		},
		{
			ID:          23, // final
			Name:        "Ядерное оружие",
			Description: "Описание товара...",
			ParentID:    intPtr(3),
			Slug:        "mass_destruction",
		},
		{
			ID:          24, // final
			Name:        "Биологическое оружие",
			Description: "Описание товара...",
			ParentID:    intPtr(3),
			Slug:        "biological_weapons",
		},
		{
			ID:          25,
			Name:        "Ракеты",
			Description: "Описание товара...",
			ParentID:    intPtr(3),
			Slug:        "rockets",
		},
		{
			ID:          26,
			Name:        "Пистолеты", // final
			Description: "Пистолеты представляют собой оружие защиты и нападения на коротких расстояниях, от стрельбы в упор до 50 м. Пистолет - это короткоствольное личное огнестрельное оружие, стрельба из которого может вестись с одной руки, без дополнительного упора. Благодаря небольшим габаритам и массе, пистолеты и револьверы могут носиться при себе постоянно и позволяют быстро открывать огонь.",
			ParentID:    intPtr(22),
			Slug:        "pistols",
		},
		{
			ID:          27,
			Name:        "Пулеметы", // final
			Description: "Пулемет — это персональное или групповое оружие поддержки. Относится к категории стрелкового. Автоматическая стрельба пулями обеспечивается энергией выхлопа пороховых газов или отдачей ствола.\n\nПринципиальным отличием от другого стрелкового оружия является большая прицельная дальность и превосходная скорострельность — до 500-1200 выстрелов в минуту. Для стрельбы часто используются сошки (опоры) или специально оборудованный станок.",
			ParentID:    intPtr(22),
			Slug:        "machine_guns",
		},
		{
			ID:          28,
			Name:        "Баллистические ракеты", // final
			Description: "Баллистическая ракета — изделие, разновидность ракетного оружия. Ракета большую часть полёта совершает по баллистической траектории, то есть находится в неуправляемом движении (см. Баллиста). Нужная скорость и направление полёта сообщаются баллистической ракете на активном участке полёта системой управления полётом ракеты.",
			ParentID:    intPtr(25),
			Slug:        "ballistic",
		},
		{
			ID:          29,
			Name:        "Крылатые ракеты", // final
			Description: "Крылатая ракета — ракетное оружие однократного запуска, траектория полёта которого определяется аэродинамической подъёмной силой крыла, тягой двигателя и силой тяжести.",
			ParentID:    intPtr(25),
			Slug:        "wings",
		},
		{
			ID:          30,
			Name:        "Танки", // final
			Description: "Танк (англ. tank) — бронированная боевая машина, чаще всего на гусеничном ходу,[сн 1] как правило с пушечным и дополнительным пулемётным вооружением, обычно во вращающейся полноповоротной башне, предназначенным в основном для стрельбы прямой наводкой.",
			ParentID:    intPtr(3),
			Slug:        "tanks",
		},
		{
			ID:          31,
			Name:        "Радиоактивные вещества", // final
			Description: "Описание товара...",
			ParentID:    intPtr(4),
			Slug:        "nuclear",
		},
		{
			ID:          32,
			Name:        "Токсичные вещества", // final
			Description: "Описание товара...",
			ParentID:    intPtr(4),
			Slug:        "toxic",
		},
	}, nil
}
