package config

type Group struct {
	Names []string
	Start float64
	End   float64
}

type Config struct {
	Trash   []string
	Objects []string
	Groups  []Group
}

var DefaultConfig = Config{
	Trash: []string{
		"показывать",
		"показать",
		"давать",
		"дать",
		"выдавать",
		"вывести",
		"выдать",
		"какой",
	},
	Objects: []string{
		"пиво",
		"пивасик",
		"пивко",
		"хмельное",
		"хмельный",
	},
	Groups: []Group{
		{
			Names: []string{
				"безалкогольный",
				"детский",
				"лоховской",
				"для ребёнок",
			},
			Start: 0.0,
			End:   0.83,
		},
		{
			Names: []string{
				"некрепкий",
				"слабейший",
				"подростковый",
				"для женщина",
				"для ребёнок",
			},
			Start: 0.83,
			End:   3.8,
		},
		{
			Names: []string{
				"слабый",
				"для женщина",
			},
			Start: 3.8,
			End:   5.5,
		},
		{
			Names: []string{
				"нормальное",
				"для ровный пацан",
				"для женщина",
			},
			Start: 5.5,
			End:   8.0,
		},
		{
			Names: []string{
				"крепкий",
				"не легкий",
				"для мужчина",
				"для мужик",
				"для илья глотов",
			},
			Start: 8.0,
			End:   9.8,
		},
		{
			Names: []string{
				"очень крепкий",
				"крепчайший",
				"славянский",
				"для крепкий парень",
				"сильный",
				"мощный",
				"не легкий",
				"для мужчина",
				"для мужик",
				"для илья глотов",
			},
			Start: 9.8,
			End:   12.0,
		},
	},
}
