// суммирует все элементы массива и прибавляет 1
len = 8; // длина массива = 8
enroll = 2; // сколько элементов обработаем за итерацию
elem_sz = 4; // размер элемента

x[len] = {1,2,3,4,5,6,7,8} // массив

x20 = len / enroll; // количество итераций
x1 = &x; // адрес массива
x31 = 0;

do {
    x2 = x1[0]; // 0 элемент
    x3 = x1[1]; // 4 элемент 

    x1 += elem_sz * enroll; // сдвиг по массиву

    x20 -= 1 // уменьшение количества итераций
    x31 += x2  
    x31 += x3 
} while (x20 != 0);

x31 += 1 // Результат = 37

while (1) {}; // бесконечный цикл
 